/* Alert cancel button */
"ALERT-CANCEL" = "Cancel";

/* Clean all caches alert button */
"ALERT-CLEAN" = "Clean";

/* Reset database alert button */
"ALERT-RESET-DB" = "Reset";

/* In Preference */
"CACHE-CLEAN-ALL-CONFIRM-MESSAGE" = "You cannot undo this action.";

/* In Preference */
"CACHE-CLEAN-ALL-CONFIRM-TITLE" = "Are you sure you want to clear all caches?";

/* Launch check */
"DB-RESET-SCHEMA-CONFIRM-MESSAGE" = "Reset will lose all local records, and there is no guarantee that the problem will be fixed.";

/* Launch check */
"DB-RESET-SCHEMA-CONFIRM-TITLE" = "Are you sure you want to reset database?";

/* Image Load Error */
"DETAIL-IMAGE-URL-NULL-ERROR" = "Image URL is null.";

/* Detail swipe reach end */
"DETAIL-REACH-END" = "No more";

/* Detail swipe reach the top */
"DETAIL-REACH-TOP" = "At the top";

/* In Preference */
"DOWNLOAD-CHOOSE-DIRECTORY-PANEL-BUTTON" = "Choose";

/* In Preference */
"DOWNLOAD-CHOOSE-DIRECTORY-PANEL-MESSAGE" = "Choose a directoriy to save";

/* In Preference */
"DOWNLOAD-DIRECTORY-NOT-SET" = "Path has not been specified.";

/* In HUD */
"FAVORITE-ADD" = "⭐️ Favorited";

/* In HUD */
"FAVORITE-REMOVE" = "💔 Unfavored";

/* Launch check */
"LaunchError-DBInitTitle" = "Database File is Abnormal";

/* Launch check */
"LaunchError-DBSchemaTitle" = "Database Initialization Failed";

/* Launch check */
"LaunchError-DBTooNewMessage" = "It seems that you have used a higher version of this app before. It is highly recommended to upgrade to the latest version.\n\nHowerver, if you choose continue, you may experience a crash or even data corruption, although it may work normally.";

/* Launch check */
"LaunchError-DBTooNewTitle" = "Downgraded Database File";

/* In Preference - Tag Blacklist */
"LIST-ACTION-REMOVE" = "Remove";

/* In Home */
"STREAM-NEW-POST" = "There are some new posts, click to view.";

/* String Dict */
"STRINGS-ImageCount" = "STRINGS-ImageCount";

/* String Dict */
"STRINGS-TagCount" = "STRINGS-TagCount";

/* In Preference - Tag Blacklist */
"TAG-BLACK-BUILDIN-NOTE" = "In order to make the content seen in the app safe for all ages, we have built-in filters. They are mandatory, you cannot edit or disable them.";

/* In Preference - Tag Blacklist */
"TAG-BLACK-BUILDIN-SECTION" = "Build In";

/* In Preference - Tag Blacklist */
"TAG-BLACK-COUNT-FILTER" = "Post Tag Count < 5";

/* In Preference - Tag Blacklist */
"TAG-BLACK-CUSTOM-SECTION" = "Custom";

/* In Preference - Tag Blacklist */
"TAG-BLACK-DELETE-TIP" = "You can delete tags by swip left or select one then press delete";

/* In HUD */
"TAG-BLACK-EDIT-EXISTE" = "Tag existed";

/* In HUD */
"TAG-BLACK-EDIT-NAME-EMPTY" = "Tag name is empty";

/* URLError */
"URLError-networkConnectionLost" = "Network connection may have been lost, please try again";

/* URLError */
"URLError-notConnectedToInternet" = "No internet connection, please check";

